load-test.yml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 60
      arrivalRate: 10
scenarios:
  - flow:
      - get:
          url: "/pelicula"
      - get:
          url: "/usuario"
      - get:
          url: "/comentario"
      - post:
          url: "/login"
          json:
            email: "testuser@example.com"
            password: "password123"
      - post:
          url: "/usuario"
          json:
            nombre: "Test User"
            email: "testuser@example.com"
            password: "password123"